In [1]:
import pandas as pd

In [2]:
data = {
    'Name': ['Dhruv', 'Akhil', 'Arun'],
    'Math': [85, 78, 90],
    'Science': [90, 83, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)
print(df)

    Name  Math  Science  English
0  Dhruv    85       90       88
1  Akhil    78       83       85
2   Arun    90       89       94

In [7]:
df2 = df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subjects", value_name="Score").copy()
df2

    Name Subjects  Score
0  Dhruv     Math     85
1  Akhil     Math     78
2   Arun     Math     90
3  Dhruv  Science     90
4  Akhil  Science     83
5   Arun  Science     89
6  Dhruv  English     88
7  Akhil  English     85
8   Arun  English     94

In [8]:
df2.pivot(index="Name", columns="Subjects", values="Score")

Subjects  English  Math  Science
Name
Akhil          85    78       83
Arun           94    90       89
Dhruv          88    85       90

In [9]:
df2.pivot_table(index="Name", columns="Subjects", values="Score", aggfunc="mean")

Subjects  English  Math  Science
Name
Akhil        85.0  78.0     83.0
Arun         94.0  90.0     89.0
Dhruv        88.0  85.0     90.0